{"newspapers": {"bbc": {"rss": "http://feeds.bbci.co.uk/news/rss.xml", "link": "http://www.bbc.com/", "articles": [{"link": "http://www.bbc.co.uk/news/world-europe-44024184", "published": "2018-05-07T01:55:34", "title": "Putin set to be inaugurated for fourth term as president of Russia", "text": "Image copyright Reuters Image caption Mr Putin was in Sochi last week to see preparations for the World Cup Russia hosts this summer\n\nVladimir Putin is due to be sworn in for a fourth term as president of Russia on Monday after winning the election in March.\n\nHe has been in power for 18 years, whether as president or prime minister, and opponents have likened his tenure to the reign of a tsar, or emperor.\n\nRiot police confronted protesters against his rule in Moscow and other Russian cities on Saturday.\n\nThere have been fears of new unrest on Monday as he takes office.\n\nThe inauguration at the Kremlin in Moscow is likely to be lower-key than in 2012, AFP news agency reports.\n\nMr Putin is only expected to meet volunteers who took part in his election campaign, the agency says.\n\nWhy were there protests?\n\nMore than 1,000 arrests are said to have been made in 19 cities across Russia on Saturday, nearly half of them in Moscow.\n\nMr Putin was re-elected president with more than 76% of the vote, his best ever election performance, but widespread irregularities were reported by some international observers. Allegations of ballot-rigging had dogged previous elections too.\n\nThe country's best-known opposition leader, Alexei Navalny, was barred from standing against Mr Putin, on grounds of a conviction for embezzlement which he denies and alleges was politically motivated.\n\nMr Navalny was arrested briefly as he tried to join Saturday's unauthorised protest rally in Moscow under the slogan \"He's not our tsar\".\n\nMedia playback is unsupported on your device Media caption Police seize the opposition leader at a rally in Moscow\n\nDomestic opponents accuse Mr Putin of undermining democracy in Russia - a policy dubbed \"managed democracy\" - to keep genuine opposition parties out of parliament and ensure that he and his allies retain power indefinitely.\n\nCould Putin just go on and on?\n\nFirst elected president in 2000, Mr Putin renewed his four-year term in 2004 before stepping aside in 2008 to serve as prime minister under his protege, Dmitry Medvedev, because by law he could only serve two consecutive terms.\n\nFew doubted who was really in charge and in 2012 Mr Putin returned as president, this time for a term of six years.\n\nIf and when he reaches the end of his fourth term in 2024, the 65-year-old will have been in power for nearly a quarter of a century.\n\nThat would still fall short of Soviet dictator Joseph Stalin's 31 years in power or, indeed, the reigns of some Russian tsars such as Alexander II (26 years) and Nicholas I (30 years).\n\nSpy turned president\n\nImage copyright Reuters Image caption Visiting a shooting gallery at the GRU military intelligence headquarters in Moscow in 2006\n\n1952: Born 7 October in Leningrad (now St Petersburg), Russia's second city, studies law and joins KGB secret police, serving as spy in communist East Germany\n\n1990s: After serving as top aide to mayor of St Petersburg, enters Boris Yeltsin's Kremlin in 1997, where he is made chief of the FSB (the KGB's successor)\n\n1999: Appointed prime minister, becomes acting president upon Yeltsin's resignation\n\n2000: Elected president and serves two four-year terms\n\n2008: Barred from running for a third consecutive term, stuns analysts by returning to post of prime minister while his protege Dmitry Medvedev becomes president\n\n2012: Re-elected president and for term of six years, under new law\n\n2018: Re-elected for fourth term\n\nHow has Russia changed under Putin?\n\nOrdinary Russians welcomed the stability associated with Mr Putin's early years in office when inflation was reined in and basic state functions like the welfare system were shored up.\n\nSeparatist violence in the North Caucasus which had plagued the administration of Mr Putin's predecessor, the late Boris Yeltsin, was finally brought to a bloody end.\n\nImage copyright Reuters Image caption With President Bashar al-Assad on a visit to Syria in 2017\n\nAs prosperity grew, fuelled by oil and gas revenue, Mr Putin oversaw an increase in state power, rolling back independent media as well as political freedoms.\n\nHis decision to annex Crimea from Ukraine in 2014 sparked one of the biggest international crises since the Cold War, incurring Western sanctions which continue to this day.\n\nRussia's alleged interference in the 2016 US presidential election soured international relations even further, while this year saw Mr Putin accused by the UK of responsibility for a nerve agent attack on its soil - allegations denied by Moscow.\n\nPolitical analyst Dmitry Oreshkin told AFP Mr Putin's approach to the international community would have to change over his new term.\n\n\"Russia hasn't been so isolated since the Soviet war in Afghanistan,\" he said.\n\n\"Now his [Putin's] task isn't to bring any new lands to Russia but to force the world to consider Russia's interests and accept its previous conquests,\" Oreshkin added."}, {"link": "http://www.bbc.co.uk/news/uk-politics-44026548", "published": "2018-05-07T03:40:01", "title": "Iran nuclear deal: Johnson tells Trump 'don't walk away'", "text": "Image copyright EPA/AFP\n\nBoris Johnson has urged President Trump not to give up on the Iran nuclear deal, saying \"at this delicate juncture it would be a mistake to walk away\".\n\nThe foreign secretary is in Washington to persuade the US president to remain a part of the international accord.\n\nThe deal saw Iran agree to limit its nuclear activities in return for the easing of sanctions on its economy.\n\nThe UK and its European allies have until 12 May to persuade Mr Trump to stick with the deal.\n\nMr Trump has strongly criticised the agreement, which he calls \"insane\".\n\nBritain, France and Germany have been working behind the scenes for weeks in an effort to preserve the deal, which was orchestrated under the Obama administration, and includes Russia and China as signatories.\n\n'Handcuffs are in place'\n\nWriting in the New York Times, Mr Johnson argued \"only Iran would gain\" from abandoning nuclear restrictions.\n\n\"Of all the options we have for ensuring that Iran never gets a nuclear weapon, this pact offers the fewest disadvantages,\" he wrote.\n\n\"It has weaknesses, certainly, but I am convinced they can be remedied.\n\n\"Indeed at this moment Britain is working alongside the Trump administration and our French and German allies to ensure that they are.\"\n\nMr Johnson said the deal had put restrictions on Iran's nuclear programme and \"now that these handcuffs are in place, I see no possible advantage in casting them aside\".\n\nHe added: \"The wisest course would be to improve the handcuffs rather than break them.\"\n\nWhile in Washington, Mr Johnson will meet US Vice-President Mike Pence, National Security Adviser John Bolton and foreign policy leaders in Congress.\n\nHe will not meet President Trump, but is expected to appear on the Fox & Friends morning news, which Mr Trump is known to watch avidly.\n\nBoth German Chancellor Angela Merkel and French President Emmanuel Macron have lobbied Mr Trump directly in recent weeks.\n\nThe UN also warned Mr Trump not to walk away from the deal.\n\nBut Mr Trump has threatened to withdraw unless the signatories agree to \"fix the deal's disastrous flaws\". The president believes the terms of the agreement are too lenient.\n\nMedia playback is unsupported on your device Media caption A timeline of what Trump's said about the Iran deal\n\nIn a call with Theresa May on Saturday, Mr Trump \"underscored his commitment to ensure that Iran never acquires a nuclear weapon\".\n\nIran's President Hassan Rouhani says the US will face \"historic regret\" if it pulls out.\n\nIn remarks carried live on state television, he said Iran had \"a plan to counter any decision Trump may take and we will confront it\".\n\nThe UK-US talks come after Israel revealed \"secret nuclear files\" accusing Iran of having run a secret nuclear weapons programme, which was reportedly mothballed 15 years ago.\n\nUS Secretary of State Mike Pompeo said the documents were authentic and show the 2015 Iran nuclear deal was \"built on lies\".\n\nIran, in turn, accused Mr Netanyahu of lying. Foreign Minister Javad Zarif said the documents produced by Israel were a rehash of old allegations already dealt with by the International Atomic Energy Agency (IAEA), the UN's nuclear watchdog.\n\nMedia playback is unsupported on your device Media caption What is the Iran nuclear deal?\n\nThe UK's ambassador to the US Sir Kim Darroch said the Iran agreement was \"a good deal\" but efforts were ongoing to \"find some language, produce some action that meets the president's concerns\".\n\n\"We think we're making progress. We haven't got there yet. We have a few days left to see if we can find a way through,\" he said.\n\nHe added that Britain and its European partners were also looking at how a deal would work even without the US."}, {"link": "http://www.bbc.co.uk/news/uk-england-london-44024948", "published": "2018-05-06T21:26:47", "title": "Boys aged 13 and 15 shot in Wealdstone, north-west London", "text": "Image copyright PA Image caption The two boys were shot on Wealdstone High Street\n\nTwo boys aged 13 and 15 have been shot in north-west London.\n\nThe 15-year-old was found wounded in Wealdstone High Street at about 13:15 BST.\n\nMinutes later paramedics alerted police officers to the 13-year-old, who had also been shot on the same road. They are both in hospital.\n\nThe shootings come after Rhyhiem Ainsworth Barton, 17, was shot dead in the street in Southwark on Saturday evening while playing football.\n\nHis mother Pretana Morgan said he \"had so much potential\" and added that she \"couldn't have asked for a better son\".\n\nImage copyright PA Image caption A jacket lies on the pavement at the junction of Palmerston Road and Wealdstone High Street\n\nPalmerston Road, just off Wealdstone High Street, was blocked off with police tape and manned by uniformed officers on Sunday evening.\n\nThe Met Police said the younger victim had suffered a shotgun pellet wound to the head.\n\nThe 15-year-old also suffered a head injury but neither was thought to be in a life-threatening condition, the force added.\n\nA shopkeeper said the 13-year-old was \"lucky to be alive\" and they believed a bullet had grazed the back of his head.\n\n\"He was holding his head down. I could not see his face but could see his white T-shirt was proper covered in blood,\" he added.\n\nIn a separate attack, a 22-year-old suffered non life-threatening wounds in a shooting in New Cross Road, Lewisham, at about 18:30.\n\nThere have been no arrests in any of the cases.\n\nImage caption Forensics teams are at the scene in Wealdstone\n\nDid you witness what happened? Email haveyoursay@bbc.co.uk.\n\nPlease include a contact number if you are willing to speak to a BBC journalist. You can also contact us in the following ways:"}, {"link": "http://www.bbc.co.uk/news/uk-44023411", "published": "2018-05-06T23:07:32", "title": "Britain's 'best and worst' railway stations named", "text": "Image copyright Getty Images\n\nGlasgow Queen Street has been named Britain's most unpopular railway station in a survey of passengers.\n\nIndependent watchdog Transport Focus took the views of more than 28,000 people at 56 stations for its ranking.\n\nOnly 58% of travellers were \"satisfied\" with Queen Street, Scotland's third busiest station. Glasgow Central nearby made the top 10 with a 91% approval.\n\nLondon King's Cross achieved a 96% score and was the most popular station, just above neighbouring St Pancras.\n\nTransport Focus said the top priorities for passengers were arrival time information, waiting rooms and the overall look of the station when it carried out the survey between September and November last year.\n\nGlasgow Queen Street is currently undergoing a £100m redevelopment, which is set to be completed by 2019.\n\nBritain's most unpopular stations\n\nThe stations passengers were least happy with between September and November 2017 - and their satisfaction rating:\n\nGlasgow Queen Street - 58%\n\nGatwick Airport - 66%\n\nOxford - 67%\n\nClapham Junction - 69%\n\nBarking - 70%\n\nWimbledon - 71%\n\nLondon Victoria - 72%\n\nHighbury and Islington - 72%\n\nHull - 73%\n\nCardiff Central - 75%\n\nThe second worst satisfaction ranking (66%) was given for the station at Gatwick Airport.\n\nOne passengers described it as \"small and cramped\" and spoke of overcrowding on platforms and long ticket queues.\n\nAnother said it was an \"appalling welcome to the UK\".\n\nImage copyright Getty Images Image caption The recently refurbished London King's Cross was the top-rated station\n\nThe four stations, which ranked the highest, have undergone major refurbishment works in recent years.\n\nTransport Focus however said investment should be targeted at making a difference to passenger experience including staff contact.\n\nA spokesman for the Rail Delivery Group, the representative body for railway companies, said it was investing to improve 178 small and medium-sized stations across the country.\n\nAnd the most popular...\n\nLondon King's Cross - 96%\n\nLondon St Pancras - 95%\n\nBirmingham New Street - 92%\n\nReading - 92%\n\nLondon Marylebone - 91%\n\nLiverpool Central - 91%\n\nBeaconsfield - 91%\n\nSheffield - 91%\n\nManchester Piccadilly - 91%\n\nGlasgow Central - 91%"}, {"link": "http://www.bbc.co.uk/news/world-middle-east-44026087", "published": "2018-05-06T22:55:06", "title": "Tutankhamun 'secret chamber' does not exist, researchers find", "text": "Image copyright Reuters Image caption A secret chamber had been thought to lie behind this wall in the boy king's tomb\n\nEgyptian authorities have finished their quest to discover a secret chamber in the tomb of Tutankhamun - concluding that it does not exist.\n\nPreviously, officials said they were \"90% sure\" of a hidden room behind the wall of the boy king's famous 3,000-year-old tomb.\n\nOne theory suggested it could have been the tomb of Queen Nefertiti - who some think was Tutankhamun's mother.\n\nNew research, however, has concluded the chamber simply is not there.\n\nThe search for the hidden tomb began when English archaeologist Nicholas Reeves, examining detailed scans of the chamber, discovered what looked like faint traces, or \"ghosts\", of doors beneath the plaster.\n\nHis 2015 paper The Burial of Nefertiti, he argued that the relatively small tomb had originally been designed for Queen Nefertiti - and her remains could possibly lie further within the tomb.\n\nNefertiti's remains have never been discovered, but she has been the object of much speculation. A 3,000-year-old sculpture of the queen, immaculately preserved, has made her one of the most recognisable women of ancient Egypt.\n\nIt is also thought she may have ruled Egypt as pharaoh herself between the death of her husband and the ascension of Tutankhamun.\n\nImage copyright AFP Image caption This bust of Queen Nefertiti, on display in Berlin, has added to her fame\n\nAfter Mr Reeves' sensational paper, a series of radar scans seemed to support his theory, leading Egyptian authorities to declare it was \"90% sure\" that a further chamber existed.\n\nA second scan also seemed to support the theory, which would have been the most significant discovery of Egyptian antiquities in decades.\n\nHowever, Italian specialists from the University of Turin used new penetrating radar scans to reach their conclusion, saying they were confident in the results.\n\n\"It is maybe a little bit disappointing that there is nothing behind the walls of Tutankhamun's tomb, but I think on the other hand that this is good science,\" said Dr Francesco Porcelli, head of the research team.\n\nHe said they had analysed three different sets of radar data and cross-checked the results, to eliminate \"complexity in the data\" which affected previous scan results.\n\nEgypt's Antiquities Minister, Khaled al-Anani, said the authorities in the country accepted the results."}, {"link": "http://www.bbc.co.uk/news/uk-44026544", "published": "2018-05-07T01:02:54", "title": "Record-breaking temperatures forecast to end bank holiday weekend", "text": "Image copyright PA Image caption A dog walker enjoys the bluebells at the Blickling Estate in Norfolk\n\nBritain looks set to enjoy record-breaking sunshine, with highs of 28C predicted on the final day of the bank holiday weekend.\n\nThe warmest May Bank Holiday Monday on record was 23.6C, in 1999. Today could be the hottest since 1978, when the holiday was introduced.\n\nThe South East, the Midlands and East Anglia are likely to be hottest spots.\n\nBut the Met Office's Charlie Powell said the top temperature would be \"the exception rather than the rule\".\n\n\"I think for most places, if you take the bulk of England and Wales for example, we're looking at somewhere around the low to mid 20s mark,\" he said.\n\nThe average high for the May Bank Holiday in London is about 18C.\n\nImage copyright @GeorgiaTurner Image caption So many people decided to head to Brighton and other South Coast seaside destinations that Southern Rail \"strongly advised\" passengers not to travel\n\nMuch of the UK has been blessed with blue skies and sunshine across the three-day holiday weekend, leading to busy roads and overcrowded trains as people flock to the coast.\n\nTemperatures peaked on Sunday at 26C in Northolt in north-west London.\n\nMeanwhile, Wales saw a top temperature of 23.6C in Llysdinam, Powys, and in Scotland the mercury reached 21.8C in Edinburgh.\n\nIn Northern Ireland, the highest recorded was 20.8C in Katesbridge.\n\nImage copyright Gillian Brady/@GBrady_ Image caption The scene at Fisherrow Harbour in Musselburgh, East Lothian, was a serene picture of blue"}, {"link": "http://www.bbc.co.uk/news/uk-england-leeds-44025685", "published": "2018-05-06T18:51:09", "title": "Near miss for Tour de Yorkshire volunteer", "text": "Video\n\nA support vehicle crashed through a traffic island and narrowly missed a volunteer during the final stage of the Tour de Yorkshire cycle race.\n\nIt happened on the fourth day of the event as cyclists headed towards the finish line in Leeds, West Yorkshire.\n\nVolunteer Phillip Sullivan said he was shaken but unhurt after leaping out of the way, and wanted to make sure the driver of the car was OK.\n\nRace organisers have been contacted for comment."}, {"link": "http://www.bbc.co.uk/sport/football/44025339", "published": "2018-05-06T19:38:04", "title": "Sir Alex Ferguson: Arsene Wenger among Premier League managers to send messages of support", "text": "Sir Alex Ferguson presented outgoing Arsenal manager Arsene Wenger with a commemorative trophy at Old Trafford last week\n\nArsene Wenger was among a host of Premier League managers to send support to Sir Alex Ferguson over the weekend after the former Manchester United boss had emergency surgery for a brain haemorrhage.\n\nFerguson, 76, remains in intensive care at Salford Royal Hospital.\n\nThe Scot retired as United manager in May 2013 after winning 38 trophies during 26 years in charge.\n\n\"He's a strong man and an optimistic man,\" said Wenger.\n\n\"We wish him all the best and that he recovers quickly.\"\n\nFerguson was at Old Trafford last Sunday when he presented departing Arsenal boss Wenger with a commemorative trophy.\n\n\"I was on the pitch with him last week. He was very happy but anything can happen,\" Wenger added.\n\n\"I went to see him in the box after the game on Sunday. He looked in perfect shape. He told me he's doing a lot of exercise, he looked very happy.\"\n\nThe most successful manager in the history of the British game, Ferguson's trophy haul at Old Trafford included 13 Premier League titles, two Champions League crowns, five FA Cups and four League Cups.\n\nHe famously won the Treble of Premier League, FA Cup and Champions League in 1999, the year in which he was knighted.\n\nFerguson has been married to wife Cathy since 1966. His son Darren manages Doncaster Rovers but did not not take charge of their League One match against Wigan on Saturday.\n\nPep Guardiola and Sir Alex Ferguson embrace before the 2011 Champions League final between Bayern Munich and Manchester United\n\nManchester City manager Pep Guardiola also sent his close friend his well wishes, revealing Ferguson had recently taken him out for dinner to congratulate him on winning the Premier League title with City.\n\n\"A big hug and our thoughts are with his wife Cathy and the Manchester United family,\" the Spaniard told Sky Sports before City's goalless draw with Huddersfield on Sunday.\n\n\"I was glad to have dinner with him two weeks ago, and hopefully he can recover as quickly as possible.\"\n\nIn a tweet on Sunday night, Manchester United thanked the \"wider football world\" for their messages of support.\n\nThe Scottish FA posted a message of support for Ferguson from Scotland manager Alex McLeish\n\nMore messages of support\n\nChelsea manager Antonio Conte: \"I'm very sad. I have had the possibility to know him and his wife and to understand that this is a special person. He's not a normal person. A manager who won many titles in his career.\n\n\"I think I appreciated a lot the man. And yesterday this news changed my day in a bad way, because we hope to see him quickly and to have our best wishes to recover very soon. Now it's very difficult. We want to stay very close also.\"\n\nLiverpool boss Jurgen Klopp: \"When I heard it yesterday on the way to London, I really couldn't believe it. It can happen to all of us.\n\n\"He will be in my prayers 100%. I wish him and his family all the best. He will be in a good shape again. I'm 100% sure. I'm looking forward to seeing him again.\"\n\nManchester City assistant manager Brian Kidd: \"He's such an iconic person as everybody knows. There was a really sombre mood yesterday evening and this morning. You think Sir Alex is really indestructible, we've all been brought up with him.\n\n\"What he did for Manchester United was unreal and the pressure he was under every day to produce. It's phenomenal.\n\n\"You know him, you lads have had your run-ins with him but you know where he's coming from; he wears his heart on his sleeve.\n\n\"The opportunity he gave me, I'm always indebted to him, god bless him. All the love in the world to him.\"\n\nPremier League executive chairman Richard Scudamore: \"It's obviously a big shock but the most important thing is to wish him well, and his family well, to respect their privacy, and hope that very, very soon he's back to his best.\n\n\"He's probably the most iconic figure of football from the last 30 years, and then when you add that to the fact that he's such a important role model to so many people around the world, he's captured the world. He's a national institution really, so therefore I'm not surprised really at the massive outpouring of support.\""}, {"link": "http://www.bbc.co.uk/news/uk-politics-44025187", "published": "2018-05-07T00:06:21", "title": "Lord Adonis apologises for Sajid Javid cartoon tweet", "text": "Image copyright PA\n\nLabour peer Lord Adonis has apologised for tweeting a cartoon which appears to mock the new home secretary.\n\nIn the tweet, which has since been deleted, a figure purporting to be Sajid Javid is seen at his desk, with the caption: \"I just want to settle in, get organised, then deport my parents!\"\n\nHe responded directly to the former education minister, Lord Adonis, saying \"you're better than this\".\n\nLord Adonis then apologised to Mr Javid for the \"poor taste\" cartoon.\n\n\"Sajid, on reflection I think the cartoon is too personal and in poor taste. I have deleted it. I am sorry,\" Lord Adonis wrote.\n\nMr Javid took over from Amber Rudd, who resigned last Sunday in a row over targets for deporting illegal immigrants.\n\nQuoting the original tweet containing the cartoon, Mr Javid said: \"Not like you Andrew Adonis, you're better than this\"."}, {"link": "http://www.bbc.co.uk/news/uk-wales-44024978", "published": "2018-05-06T16:09:56", "title": "Neil Warnock's daughter interrupts Cardiff press conference", "text": "Video\n\nCardiff City manager Neil Warnock's post-match press conference was interrupted by his daughter.\n\nHe was speaking after the Bluebirds won promotion to the Premier League on Sunday.\n\nThey clinched the second automatic promotion spot after drawing 0-0 at home to Reading."}, {"link": "http://www.bbc.co.uk/news/entertainment-arts-44024889", "published": "2018-05-06T18:38:40", "title": "Doctor Foster star Suranne Jones pulls out of West End play", "text": "Image copyright Getty Images Image caption Suranne Jones starred in two series of Doctor Foster, winning a Bafta for best leading actress\n\nDoctor Foster actress Suranne Jones has said she is \"so gutted\" after pulling out of West End play Frozen due to illness.\n\nThe star, 39, apologised to fans after she missed the last four performances of the show's run, which finished on Saturday.\n\nJones, who played a mother whose child has been abducted, said the show subject matter was \"deeply affecting\".\n\n\"I'm certain it has contributed to my feeling under the weather,\" she added.\n\nPosting a message on her Instagram page, Jones said she was unable to finish Thursday's matinee at the Theatre Royal Haymarket in London after feeling dizzy on stage.\n\n\"I came back after an illness and it was perhaps too soon,\" she wrote.\n\n\"Anyone who knows the show knows it is a highly draining piece and after three months and a sickness I just wasn't able to end the run.\"\n\n'Taken its toll'\n\nShe said she had hoped to return to the stage for the final performance on Saturday but was told by her doctor she should not \"put myself through it and risk getting ill again\".\n\n\"This show has taken it's toll on me,\" she said.\n\n\"You as the audience experience it once and always say how you are moved and drained by it. We as performers always think we can push through and carry on but sometimes we just can't.\"\n\nThe Bafta award winner said she plans to rest before filming begins for new eight-part BBC series Gentlemen Jack later this month.\n\nThe series, which is created and directed by Happy Valley writer Sally Wainwright, will be filmed in West Yorkshire and Copenhagen.\n\nJones played the role of Dr Gemma Foster, a woman who suspected her husband of having an affair, in the BBC One drama series Doctor Foster."}, {"link": "http://www.bbc.co.uk/news/business-44006176", "published": "2018-05-06T23:06:44", "title": "Vanilla price rise proves chilling for ice-cream makers", "text": "The price of vanilla has soared over the last two years, sending a chill down the spine of UK ice-cream makers.\n\nAt around $600 per kilo the sweet ingredient costs more than silver.\n\nSnugburys Ice Cream is run by three sisters near Nantwich in Cheshire. The business churns out around five tonnes of ice cream in a busy week from the family farm.\n\nAround a third of their 40 flavours contain vanilla in some form and they are paying their supplier 30 times more for the extract than they did in previous years.\n\n\"It has really gone up, so last year we decided to buy it forward by a year's-worth,\" said Cleo Sadler, who manages the production side of the business.\n\n\"We had to make a decision as to whether we would absorb the costs - which we did in the end.\"\n\nBuying ahead means the sisters have sufficient stock for the coming summer and can stick to their prices.\n\nBut at least one other UK ice-cream business has stopped serving vanilla due to the higher costs.\n\nJulie Fisher, who founded artisanal ice-cream maker Ruby Violet seven years ago, told the BBC vanilla was off the menu in her London-based outlets \"for the foreseeable future\" because she can't afford the thousands of pounds it would cost.\n\nAnd others are reported to also be reconsidering their use of expensive extract.\n\nSnugbury's distributes all over the North West of England, but also runs a popular shop on-site where a steady stream of families drop in on their way across the countryside.\n\nMedia playback is unsupported on your device Media caption Ice-cream makers struggle with soaring vanilla prices\n\nMs Sadler and her sisters, Kitty and Hannah, pride themselves on homemade ingredients, so would not consider synthetic alternatives to vanilla.\n\n\"As for the future, well we will have to sit down, crunch the figure, and see how it's going to work out for us for the years to come,\" she said.\n\nWhy is vanilla price soaring?\n\nThe vast majority of vanilla - over 75% - is grown on the tropical island of Madagascar, off the South East coast of the African Continent.\n\n\"The main reason for the high price is that there was a cyclone in Madagascar last March which damaged a lot of the plantations,\" said Julian Gale, a commodities analyst for IEG Vu.\n\n\"And despite hopes that the price would have eased by now, it's still holding on the high side because demand is so strong.\"\n\nIt's a difficult spice to cultivate, extracted from the delicate vanilla orchid flower. As a result, vanilla is the second most expensive spice in the world, after saffron.\n\n\"The other big producers are Papua New Guinea, India and Uganda,\" said Mr Gale.\n\n\"It's exported globally, a lot goes to America as it has a big ice cream industry.\"\n\nIt's not just ice cream: vanilla is popular across sweet foods, alcohol, as well as scented perfumes, cosmetics and perfumes.\n\nNatural vanilla extract comes in potent, sweet scented brown liquor. Food manufacturers also purchase spent vanilla powder, the little black dots sometimes seen in ice cream. The price of that has also increased threefold.\n\nSynthetic flavouring called vanillin is extracted from wood and sometimes even petroleum. It is anticipated it will now be more widely used across industries trying to avoid escalating"}, {"link": "http://www.bbc.co.uk/news/blogs-the-papers-44025996", "published": "2018-05-06T23:39:21", "title": "Newspaper headlines: Tory rebels 'furious' with PM and Britain bakes", "text": "Image caption\n\nThe Daily Telegraph also homes in on the unusually warm bank holiday weather, with a picture of a youngster in Lymington River in the New Forest. The lead story reports that Justice Minister Lucy Frazer QC is considering a change in the law to give grandparents the legal right to see their grandchildren after divorce. Like the FT, the paper also reports on the Brexiteers' \"furious\" reaction to Business Secretary Greg Clark's comments that Britain staying in the customs union was still \"on the table\" amid fears of job losses after Brexit."}, {"link": "http://www.bbc.co.uk/news/disability-44004823", "published": "2018-05-06T23:36:53", "title": "How #HotPersonInAWheelchair is fighting hate on Twitter", "text": "Image copyright Annie Segarra\n\nA US YouTuber has inspired a Twitter campaign after she read a tweet that said: \"Nothing sadder than a hot person in a wheelchair.\"\n\nThe tweet that got Annie Segarra so annoyed was actually four years old. It had been written by author Ken Jennings, known in the US for winning the classic TV game show Jeopardy! 74 times in a row - and pocketing more than $2.5m (£1.85m) in the process.\n\nSegarra, who tweets using the Twitter handle @annieelainey - adapted Jennings' tweet so it read \"#HotPersonInAWheelchair\", adding: \"Cry about it, babe\". She attached a photo to the tweet showed her in a chic outfit.\n\nImage copyright Annie Segarra/Twitter\n\nMore than 2,700 people liked the post from Segarra - who was diagnosed with Ehlers-Danlos syndrome (EDS) in 2014 and is now a wheelchair user.\n\nIt prompted some of her followers who are also wheelchair users to post photos of themselves with the same hashtag.\n\nAustralian para-athlete Robyn Lambird (@Robyn_lambird) shared this image of herself wearing a white hoodie.\n\nImage copyright Robyn Lambird\n\nAnd this came from Elsie, wearing a pink leather jacket (@65PinkRoses).\n\nImage copyright @65PinkRoses/Twitter\n\nListen to this week's Ouch podcast\n\nMedia playback is unsupported on your device\n\nThe team discuss the recent death of actor Verne Troyer and whether the character he was best known for - Mini-Me in the Austin Powers films - has normalised violent attacks against others with dwarfism.\n\nSegarra addressed the issue further on Facebook.\n\n\"We're here, we're hot, we deserve to feel hot, to be seen, to take up space,\" she posted.\n\n\"We deserve to use the mobility aids and any other device or assistance we need without shame.\n\n\"I think what's important here is that tweets stand the test of time. They still have the power to hurt and offend or anger years after posting when their author totally forgot what they'd originally said.\"\n\nMeanwhile images using Segarra's hashtag kept coming. Diogo Martins (@rodas89) tweeted a picture of himself and his partner, both in wheelchairs.\n\n\"A hot woman in a wheelchair is in a relationship with a guy (who she states is hot too) in a wheelchair!\" he wrote in the caption.\n\nImage copyright Diogo Martins/Twitter\n\nAnd Caitlin Goerlich (‏@CGoerlich) commented to Ken Jennings, the original tweeter, \"Hey @KenJennings - I think you are very, very wrong.\"\n\nShe then posted photos of herself in prom dresses, casually at home and practising archery.\n\nImage copyright Caitlin Goerlich/Twitter\n\nBack in 2014 - when the original tweet was posted - California-based stand-up comic Billy Anderson (@BillyAndersonYo) tried to lighten the mood. He tweeted a posed-by-model image of a man in a wheelchair sweltering in a sunny garden.\n\n\"When @KenJennings tweeted 'Nothing sadder than a hot person in a wheelchair' pretty sure he meant it THIS way. #SoSad\"\n\nKen Jennings hasn't responded directly to the most recent criticism to date."}, {"link": "http://www.bbc.co.uk/news/world-africa-44007382", "published": "2018-05-06T23:10:48", "title": "Marylove Edwards: The 13-year-old 'Nigerian Serena'", "text": "I'm back and ready - Serena Williams\n\nAs she prepares to return to the WTA Tour, Serena Williams says she is \"ready to play\" even if it is at a \"turtle's pace\"."}, {"link": "http://www.bbc.co.uk/news/uk-43761093", "published": "2018-05-06T23:37:09", "title": "Can you make a community healthier?", "text": "Video\n\nLife expectancy in Fleetwood, Lancashire, is among the worst in the UK, with diseases linked to diet and drugs claiming lives.\n\nThe Healthier Fleetwood programme is planning to change all that."}, {"link": "http://www.bbc.co.uk/news/world-us-canada-44008153", "published": "2018-05-06T23:50:17", "title": "Could Trump's 'Space Force' become a reality?", "text": "Could Trump's 'Space Force' become a reality?\n\n\"We're getting very big in space,\" says the US president. What would a new branch of the military do?"}, {"link": "http://www.bbc.co.uk/news/uk-england-devon-44023712", "published": "2018-05-06T15:54:09", "title": "Aeroplane makes emergency landing on Devon beach", "text": "Video\n\nA vintage light aeroplane has made an emergency landing on a beach after its engine failed.\n\nPilot Zac Rockey was praised for safely navigating onto the sand at Jacobs Ladder, Devon, which backs onto a tall steep cliff."}, {"link": "http://www.bbc.co.uk/news/uk-44022190", "published": "2018-05-06T13:59:13", "title": "Royal baby photo brings back precious memories for families", "text": "A photo taken by the Duchess of Cambridge of baby Prince Louis being kissed by his older sister Charlotte has brought back fond memories to many families of their own children's first pictures together.\n\nImage copyright Joanna Image caption Alexander, 5, looking delighted to meet his day-old sister Miya born in October\n\nImage copyright Emma Louise Image caption \"Unconditional love from the very moment they set eyes on each other.\" Elle, 4, meeting baby Brooke, born on 12 April 2018\n\nImage copyright Hannah Jones Image caption \"One of the most overwhelmingly emotional times of my life.\" Hannah Jones remembering her daughter Gemma meeting baby Oscar last year\n\nImage copyright LouiseEmery Image caption A \"magical moment\" for Charlie, 5, holding his baby brother Max last year who had been in the neonatal intensive care unit for 40 days\n\nImage copyright Emily Mead Image caption Edward, 2, meeting Margot Louisa Mary after she was born on Valentine's Day this year. \"To say he was besotted is an understatement,\" their mum said\n\nImage copyright Charlotte Lomas Image caption Amelia cuddling her sister Eliza on the baby's first morning at home\n\nImage copyright Tony White Image caption Penny, 3, getting cosy with her sister Lois in 2013. \"Seeing Lois for the first time, she was adorable wrapped up,\" Penny told her mum five years on\n\nImage copyright Helen Meynell Image caption Lois cuddling her twin brother and sister in 2010\n\nImage copyright Hayley Smith Image caption Athena with her big brother Ptolemy in December last year\n\nBy UGC & Social news"}, {"link": "http://www.bbc.co.uk/news/world-europe-isle-of-man-44023367", "published": "2018-05-06T17:51:59", "title": "Friendly seal nuzzles up to diver in Isle of Man", "text": "Video\n\nA diver got a big seal of approval during an underwater trip off the Isle of Man.\n\nThe playful mammal appeared to take hold of Colin Peters before stroking and nuzzling him.\n\nMr Peters said: \"It was a very memorable dive and the first time I have seen a seal spend so much time with people and interact like it did.\"\n\nFootage courtesy of Colin Peters and Jim Self."}]}}}